# 多表查询

In [49]:
%load_ext sql
%sql mysql+mysqlconnector://root:123456@localhost:3306/world

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## 多表关系

### 概述

* 一对多(多对一)
* 多对多
* 一对一

<img src='./image/多表关系一对多.jpg' width='70%'>

<img src='./image/多表关系多对多.jpg' width='70%'>

<img src='./image/多表关系一对一.jpg' width='70%'>

## 多表查询概述

<img src="./image/多表查询概述.jpg" width="70%">

## 多表查询分类

<img src="./image/多表查询分类.jpg" width="70%">

## 内连接

<img src="./image/内连接.jpg" width='70%'>

### 1. 隐式内连接

In [50]:
%%sql
SELECT
    city.Name 城市, country.Name 国家, city.Population 人口
FROM
    city, country
WHERE
    city.CountryCode = country.Code
    AND
    city.Population > 8000000
ORDER BY
    city.Population DESC;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('Mumbai (Bombay)', 'India', 10500000),
 ('Seoul', 'South Korea', 9981619),
 ('São Paulo', 'Brazil', 9968485),
 ('Shanghai', 'China', 9696300),
 ('Jakarta', 'Indonesia', 9604900),
 ('Karachi', 'Pakistan', 9269265),
 ('Istanbul', 'Turkey', 8787958),
 ('Ciudad de México', 'Mexico', 8591309),
 ('Moscow', 'Russian Federation', 8389200),
 ('New York', 'United States', 8008278)]

### 2. 显式内连接

In [51]:
%%sql
SELECT
    city.Name 城市, country.Name 国家, city.Population 人口
FROM
    city
INNER JOIN
    country
ON
    city.CountryCode = country.Code
ORDER BY
    city.Population DESC
LIMIT
    12;

 * mysql+mysqlconnector://root:***@localhost:3306/world
12 rows affected.

[('Mumbai (Bombay)', 'India', 10500000),
 ('Seoul', 'South Korea', 9981619),
 ('São Paulo', 'Brazil', 9968485),
 ('Shanghai', 'China', 9696300),
 ('Jakarta', 'Indonesia', 9604900),
 ('Karachi', 'Pakistan', 9269265),
 ('Istanbul', 'Turkey', 8787958),
 ('Ciudad de México', 'Mexico', 8591309),
 ('Moscow', 'Russian Federation', 8389200),
 ('New York', 'United States', 8008278),
 ('Tokyo', 'Japan', 7980230),
 ('Peking', 'China', 7472000)]

## 外连接

<img src='./image/多表查询外连接.jpg' width='70%'>

### 1.左外连接

In [52]:
%%sql
SELECT
    city.Name 城市, country.Name 所属国家, city.Population 城市人口, countrylanguage.Language 官方语言
FROM
    city
LEFT JOIN
    country
ON
    city.CountryCode = country.Code
LEFT JOIN
    countrylanguage
ON
    city.CountryCode = countrylanguage.CountryCode AND countrylanguage.IsOfficial = 'T'
ORDER BY
    city.Population DESC
LIMIT
    12;

 * mysql+mysqlconnector://root:***@localhost:3306/world
12 rows affected.

[('Mumbai (Bombay)', 'India', 10500000, 'Hindi'),
 ('Seoul', 'South Korea', 9981619, 'Korean'),
 ('São Paulo', 'Brazil', 9968485, 'Portuguese'),
 ('Shanghai', 'China', 9696300, 'Chinese'),
 ('Jakarta', 'Indonesia', 9604900, 'Malay'),
 ('Karachi', 'Pakistan', 9269265, 'Urdu'),
 ('Istanbul', 'Turkey', 8787958, 'Turkish'),
 ('Ciudad de México', 'Mexico', 8591309, 'Spanish'),
 ('Moscow', 'Russian Federation', 8389200, 'Russian'),
 ('New York', 'United States', 8008278, 'English'),
 ('Tokyo', 'Japan', 7980230, 'Japanese'),
 ('Peking', 'China', 7472000, 'Chinese')]

### 2. 右外连接

> 人口前十国家的 首都、人口及官方语言

In [53]:
%%sql
SELECT
    country.Name 国家, city.Name 首都, country.Population 国家人口, countrylanguage.Language 官方语言
FROM
    country
RIGHT JOIN
    city
ON
    city.CountryCode = country.Code AND country.Capital = city.ID
RIGHT JOIN
    countrylanguage
ON
    country.Code = countrylanguage.CountryCode AND countrylanguage.IsOfficial = 'T'
ORDER BY
    country.Population DESC
LIMIT
    10;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('China', 'Peking', 1277558000, 'Chinese'),
 ('India', 'New Delhi', 1013662000, 'Hindi'),
 ('United States', 'Washington', 278357000, 'English'),
 ('Indonesia', 'Jakarta', 212107000, 'Malay'),
 ('Brazil', 'Brasília', 170115000, 'Portuguese'),
 ('Pakistan', 'Islamabad', 156483000, 'Urdu'),
 ('Russian Federation', 'Moscow', 146934000, 'Russian'),
 ('Bangladesh', 'Dhaka', 129155000, 'Bengali'),
 ('Japan', 'Tokyo', 126714000, 'Japanese'),
 ('Mexico', 'Ciudad de México', 98881000, 'Spanish')]

## 自连接

<img src='./image/多表查询自连接.jpg' width='70%'>

## 联合查询

<img src="./image/联合查询.jpg" width="70%" >

<div style="color:red" />
* 对于联合查询的多张表的列数必须保持一致, 字段类型也需要保持一致<br>
* union all 会将全部数据直接合并到一起， union会对合并后的结果进行去重
</div>

### 1.UNION ALL

In [54]:
%%sql
SELECT Name, Population, Continent FROM country WHERE Population > 200000000
UNION ALL
SELECT Name, Population, Continent FROM country WHERE Continent = 'Asia' AND  Population > 100000000 LIMIT 15;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('China', 1277558000, 'Asia'),
 ('Indonesia', 212107000, 'Asia'),
 ('India', 1013662000, 'Asia'),
 ('United States', 278357000, 'North America'),
 ('Bangladesh', 129155000, 'Asia'),
 ('China', 1277558000, 'Asia'),
 ('Indonesia', 212107000, 'Asia'),
 ('India', 1013662000, 'Asia'),
 ('Japan', 126714000, 'Asia'),
 ('Pakistan', 156483000, 'Asia')]

### 2. UNION

In [55]:
%%sql
SELECT Name, Population, Continent FROM country WHERE Population > 200000000
UNION
SELECT Name, Population, Continent FROM country WHERE Continent = 'Asia' AND  Population > 100000000 LIMIT 15;

 * mysql+mysqlconnector://root:***@localhost:3306/world
7 rows affected.

[('China', 1277558000, 'Asia'),
 ('Indonesia', 212107000, 'Asia'),
 ('India', 1013662000, 'Asia'),
 ('United States', 278357000, 'North America'),
 ('Bangladesh', 129155000, 'Asia'),
 ('Japan', 126714000, 'Asia'),
 ('Pakistan', 156483000, 'Asia')]

## 子查询

<img src='./image/子查询概述.jpg' width='70%'>

### 标量子查询

> 子查询返会的结果是单个值(数字、字符串、日期等), 最简单的形式, 这种子查询称为 <mark/>标量子查询</mark> <br>
> 常见操作符： <mark/> = <> > >= < <= <mark>

#### 1. 查找中国的首都人口

In [56]:
%%sql
SELECT 
    Name 城市, ROUND(Population/10000, 2) '人口(万)' 
FROM 
    city 
WHERE
    ID = (
        SELECT
            Capital
        FROM
            country
        WHERE Name = "China" 
    )

 * mysql+mysqlconnector://root:***@localhost:3306/world
1 rows affected.

[('Peking', Decimal('747.20'))]

### 列子查询

> 子查询返回的结果是一列，称为<mark/>列子查询</mark><br>
> 常见操作符: <mark/> IN、 NOT IN、 ANY、SOME、 ALL </mark>

| 操作符 | 描述 |
| :----: | :----: |
| IN | 在指定的集合范围内， 多选一|
| NOT IN | 不在指定的集合范围之内 | 
| ANY | 子查询返回列表中, 有任意一个满足即可 | 
| SOME | 与ANY等同, 使用SOME的地方都可以使用ANY | 
| ALL | 子查询返回列表的所有值都必须满足 |

#### 1. 查询亚洲国家的首都

> 只返回首都人口前十的国家

In [65]:
%%sql
SELECT 
    country.Name 国家, city.Name 首都, ROUND(city.Population/10000, 2) '首都人口(万)'
FROM 
    city
LEFT JOIN
    country 
ON 
    city.CountryCode = country.Code
WHERE
    ID IN (
        SELECT
            Capital
        FROM
            country
        WHERE 
            Continent = 'Asia' AND Capital IS NOT NULL
    )
ORDER BY
    city.Population DESC
LIMIT
    10;

 * mysql+mysqlconnector://root:***@localhost:3306/world
10 rows affected.

[('South Korea', 'Seoul', Decimal('998.16')),
 ('Indonesia', 'Jakarta', Decimal('960.49')),
 ('Japan', 'Tokyo', Decimal('798.02')),
 ('China', 'Peking', Decimal('747.20')),
 ('Iran', 'Teheran', Decimal('675.88')),
 ('Thailand', 'Bangkok', Decimal('632.02')),
 ('Iraq', 'Baghdad', Decimal('433.60')),
 ('Singapore', 'Singapore', Decimal('401.77')),
 ('Bangladesh', 'Dhaka', Decimal('361.29')),
 ('Myanmar', 'Rangoon (Yangon)', Decimal('336.17'))]

#### 2. 查找国家面积不低于亚洲前三的所有国家

In [83]:
%%sql
SELECT
    Name 国家, Continent 洲, ROUND(SurfaceArea/10000, 2) '面积(/万km^2)'
FROM
    country
WHERE
    SurfaceArea >= SOME (
        SELECT
            SurfaceArea
        FROM
        (
            SELECT
                SurfaceArea
            FROM
                country
            WHERE
                Continent = 'Asia'
            ORDER BY
                SurfaceArea DESC
            LIMIT
                3
        ) Three   
    ) 
    AND Name != Continent   -- 国家为洲的特殊数据排除
ORDER BY
    SurfaceArea DESC;

 * mysql+mysqlconnector://root:***@localhost:3306/world
9 rows affected.

[('Russian Federation', 'Europe', Decimal('1707.54')),
 ('Canada', 'North America', Decimal('997.06')),
 ('China', 'Asia', Decimal('957.29')),
 ('United States', 'North America', Decimal('936.35')),
 ('Brazil', 'South America', Decimal('854.74')),
 ('Australia', 'Oceania', Decimal('774.12')),
 ('India', 'Asia', Decimal('328.73')),
 ('Argentina', 'South America', Decimal('278.04')),
 ('Kazakstan', 'Asia', Decimal('272.49'))]

### 行子查询

> 子查询返回的结果是一行, 称为 <mark/>行子查询</mark><br>
> 常用的操作符: <mark/> = 、 <>、 IN、 NOT IN </mark>

#### 1. 查找国土面积和人口均大于美国的国家(包含美国)

In [91]:
%%sql
SELECT
    Name 国家, CEIL(SurfaceArea/10000) '面积(万km^2)', ROUND(Population/100000000, 2) '人口(亿)'
FROM
    country
WHERE
    (SurfaceArea, Population) > (
        SELECT
            SurfaceArea, Population
        FROM
            country
        WHERE
            Name = 'United States'
    )

 * mysql+mysqlconnector://root:***@localhost:3306/world
4 rows affected.

[('Antarctica', 1312, Decimal('0.00')),
 ('Canada', 998, Decimal('0.31')),
 ('China', 958, Decimal('12.78')),
 ('Russian Federation', 1708, Decimal('1.47'))]

### 表子查询

> 子查询返回的结果是多行多列, 这种查询称为<mark/>表子查询</mark><br>
> 常用的操作符: <mark/>IN</mark>

#### 1. 统计人口前十的国家的国土总面积以及总人口

In [104]:
%%sql
SELECT
    ROUND(SUM(SurfaceArea)/10000, 2) '总面积(万平方千米)',
    ROUND(SUM(Population)/100000000, 2) '总人口(亿)'
FROM
    (
        SELECT
            Name, SurfaceArea, Population
        FROM
            country
        ORDER BY
            Population DESC
        LIMIT
            10
    ) sub_country

 * mysql+mysqlconnector://root:***@localhost:3306/world
1 rows affected.

[(Decimal('5199.27'), Decimal('36.23'))]